; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	satellite5 - satellite
	instrument11 - instrument
	instrument12 - instrument
	instrument13 - instrument
	satellite6 - satellite
	instrument14 - instrument
	thermograph1 - mode
	infrared0 - mode
	spectrograph2 - mode
	Star5 - direction
	GroundStation1 - direction
	Star0 - direction
	GroundStation7 - direction
	GroundStation4 - direction
	Star6 - direction
	GroundStation3 - direction
	GroundStation2 - direction
	Planet8 - direction
	Star9 - direction
	Planet10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 infrared0)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 thermograph1)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
	(supports instrument3 thermograph1)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 Star6)
	(calibration_target instrument3 Star5)
	(supports instrument4 infrared0)
	(calibration_target instrument4 GroundStation2)
	(calibration_target instrument4 GroundStation1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star9)
	(supports instrument5 spectrograph2)
	(calibration_target instrument5 Star0)
	(supports instrument6 infrared0)
	(supports instrument6 thermograph1)
	(supports instrument6 spectrograph2)
	(calibration_target instrument6 GroundStation3)
	(calibration_target instrument6 Star0)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon12)
	(supports instrument7 thermograph1)
	(calibration_target instrument7 GroundStation4)
	(supports instrument8 infrared0)
	(calibration_target instrument8 Star6)
	(supports instrument9 thermograph1)
	(supports instrument9 spectrograph2)
	(calibration_target instrument9 GroundStation7)
	(calibration_target instrument9 GroundStation3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star6)
	(supports instrument10 thermograph1)
	(supports instrument10 spectrograph2)
	(supports instrument10 infrared0)
	(calibration_target instrument10 GroundStation4)
	(calibration_target instrument10 GroundStation2)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon12)
	(supports instrument11 thermograph1)
	(supports instrument11 spectrograph2)
	(supports instrument11 infrared0)
	(calibration_target instrument11 GroundStation3)
	(supports instrument12 spectrograph2)
	(calibration_target instrument12 Star6)
	(supports instrument13 infrared0)
	(supports instrument13 spectrograph2)
	(calibration_target instrument13 GroundStation3)
	(on_board instrument11 satellite5)
	(on_board instrument12 satellite5)
	(on_board instrument13 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star5)
	(supports instrument14 thermograph1)
	(calibration_target instrument14 GroundStation2)
	(on_board instrument14 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Star0)
)
(:goal (and
	(pointing satellite1 GroundStation7)
	(pointing satellite2 Planet10)
	(pointing satellite4 GroundStation7)
	(pointing satellite5 GroundStation4)
	(pointing satellite6 Star13)
	(have_image Planet8 thermograph1)
	(have_image Star9 thermograph1)
	(have_image Planet10 thermograph1)
	(have_image Star11 thermograph1)
	(have_image Phenomenon12 infrared0)
	(have_image Star13 infrared0)
	(have_image Star14 spectrograph2)
))

)

; plan
1. (turn_to satellite6 star13 star0)
   deleted: (pointing satellite6 star0)
   added: (pointing satellite6 star13)
   goals met: 1 of 12
2. (turn_to satellite5 groundstation4 star5)
   deleted: (pointing satellite5 star5)
   added: (pointing satellite5 groundstation4)
   goals met: 2 of 12
3. (turn_to satellite4 groundstation7 phenomenon12)
   deleted: (pointing satellite4 phenomenon12)
   added: (pointing satellite4 groundstation7)
   goals met: 3 of 12
4. (turn_to satellite2 groundstation3 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 groundstation3)
   goals met: 3 of 12
5. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 3 of 12
6. (calibrate satellite2 instrument6 groundstation3)
   added: (calibrated instrument6)
   goals met: 3 of 12
7. (turn_to satellite2 star11 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 star11)
   goals met: 3 of 12
8. (take_image satellite2 star11 instrument6 thermograph1)
   added: (have_image star11 thermograph1)
   goals met: 4 of 12
9. (turn_to satellite2 planet8 star11)
   deleted: (pointing satellite2 star11)
   added: (pointing satellite2 planet8)
   goals met: 4 of 12
10. (take_image satellite2 planet8 instrument6 thermograph1)
   added: (have_image planet8 thermograph1)
   goals met: 5 of 12
11. (turn_to satellite2 phenomenon12 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 phenomenon12)
   goals met: 5 of 12
12. (turn_to satellite1 groundstation7 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 groundstation7)
   goals met: 6 of 12
13. (take_image satellite2 phenomenon12 instrument6 infrared0)
   added: (have_image phenomenon12 infrared0)
   goals met: 7 of 12
14. (turn_to satellite2 star13 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 star13)
   goals met: 7 of 12
15. (take_image satellite2 star13 instrument6 infrared0)
   added: (have_image star13 infrared0)
   goals met: 8 of 12
16. (turn_to satellite2 star14 star13)
   deleted: (pointing satellite2 star13)
   added: (pointing satellite2 star14)
   goals met: 8 of 12
17. (take_image satellite2 star14 instrument6 spectrograph2)
   added: (have_image star14 spectrograph2)
   goals met: 9 of 12
18. (turn_to satellite2 star9 star14)
   deleted: (pointing satellite2 star14)
   added: (pointing satellite2 star9)
   goals met: 9 of 12
19. (take_image satellite2 star9 instrument6 thermograph1)
   added: (have_image star9 thermograph1)
   goals met: 10 of 12
20. (turn_to satellite2 planet10 star9)
   deleted: (pointing satellite2 star9)
   added: (pointing satellite2 planet10)
   goals met: 11 of 12
21. (take_image satellite2 planet10 instrument6 thermograph1)
   added: (have_image planet10 thermograph1)
   goals met: 12 of 12
